#模块
import random
import time

#各参数面板
p = 0
qwe = 0
rmb = 0
hp = 2
tl = 20
player = []
home = '''
_____________________________帮 助_____________________________
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
 钱包      显示自身的RMB       背包      查看所得所有物品       
 物品      查看自身常见物品    拾荒      扣除体力获取物品     
 计算      答题来赚取RMB       猜数      猜出系统缩想的数
 系统      查看折叠的代码      
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
抵制不良游戏，拒绝盗版游戏。
---------------------------------------------------------------
游戏版本：v1.01   版本号：2022011101
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>'''

hope = '''           ____系 统____
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
物品使用说明   (输入后及可看到说明)
抽奖几率说明   (输入后及可看到说明)
答题赚钱说明   (输入后及可看到说明)
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
更多代码，敬请期待......
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>'''

hope1 = '''>>>>>>>>>>>>>
 软妹币剩余:
 (   {0}元  )
>>>>>>>>>>>>>'''.format(rmb)

hope2 = '''           物品使用说明
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
   饮料   使用方法:
 在饮料前面加上使用。
   医疗包 使用方法：
 在使用前面加上使用。
   面包   使用方法：
 在面包前面加上食用。
   熟食   使用方法：
 在熟食前面加上食用。
   蜂蜜   使用方法：
 在蜂蜜前面加上涂上。
   酒精   使用方法：
 在酒精前面加上使用。
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
饮料   增加或回复2点体力值
医疗包 增加或回复5点生命值
面包   增加或回复2点饱食度
熟食   增加或回复5点饱食度
蜂蜜   增加或回复3点生命值
酒精   减一点生命值恢复体力
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>'''

hope3 = '''>>>>>>>>>>>>>>>>>>>>>>
无论发送啥都会关闭游戏
>>>>>>>>>>>>>>>>>>>>>>
你:'''

hope4 = '''          抽奖几率说明
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
[饮料]            ^60%
[医疗包]          ^20%
[木板]            ^10%
[碎石]            ^4%
[木棍]            ^2%
[面包]            ^1%
[熟食]            ^0.5%
[酒精]            ^0.1%
[蜂蜜]            ^0.01%
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>'''

hope5 = '''          答题赚钱说明
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
答题赚钱一共有两种：
1.计算答题赚钱
2.猜数答题赚钱
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
计算答题赚钱：
1.如何打开？
答：打开方式为输入[ 计算 ]
2.怎么开始？
答：打开后按照提示输入需要答的数量
再输入[ 1 ]来开始
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
猜数答题赚钱：
1.如何打开？
答：输入[ 猜数 ]打开
2.怎么开始？
答：输入后及开始
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
'''

#指令组开头
print(home)
while True:
    a = input("你:")
    if a == '帮助':
        print(home)
    if a == '钱包':
        print(hope1)
    if a == '关闭':
        b = input(hope3)
        break
    elif a == '背包':
        print('你拥有的物品')
        print(player)
    if a == '系统':
        print(hope)
    if a == '物品使用说明':
        print(hope2)
    if a == '抽奖几率说明':
        print(hope4)
    if a == '答题赚钱说明':
        print(hope5)
    elif a == '使用医疗包':
        az = player.count("医疗包")
        ax = int(az)
        b = input('''医疗包剩余({0})，发送[ 2 ]确定使用
'''.format(ax))
        if b == '2':
            if ax < 1:
                print("当前医疗包不足，不能使用")
            else:
                ax = ax-1
                hp = hp+5
                print('HP增加成功，HP剩余({0}%)').format(hp)
    elif a == '使用饮料':
        za = player.count('饮料')
        zf = int(za)
        b = input('''饮料剩余({0})，发送[ 2 ]确定使用
你:'''.format(zf))
        if b == '2':
            if zf < 1:
                print("饮料不足，不能使用")
            else:
                zf = zf-1
                tl = tl+2
                print('体力增加成功，剩余({0}%)'.format(tl))
    elif a == '食用面包':
        sd = player.count("面包")
        cx = int(sd)
        b = input('''面包剩余({0})，发送[ 2 ]确定使用
'''.format(cx))
        if b == '2':
            if ax < 1:
                print("当前面包不足，不能使用")
            else:
                ax = ax-1
                hp = hp+5
                print('HP增加成功，HP剩余({0}%)').format(hp)
    elif a == "充值":
        zs = input('''您的余额为{0},请问您要充值多少？
'''.format(rmb))
        za = int(zs)
        if 0 < za < 10000:
            a = random.randint(1, 5)
            if a == 1:
                print("恭喜您，充值成功")
                print("已到账{0}元，可输入“rmb”查看".format(za))
                rmb = rmb+za
            else:
                print("充值失败，请联系管理员或者作者并把错误代码提供")
                print("错误代码：404  滞留金额：{0}".format(za))
        else:
            print("充值失败，请联系管理员或者作者并把错误代码提供")
            print("错误代码：404  滞留金额：{0}".format(za))
    elif a == '版本':
        print('''♢版本号：v1.0
♢开发者：[梦之魇]
♢版权：此游戏版权归[梦之魇]所有
♢特别鸣谢：[ResuRrction],[C:\ _]和[CrosWuft]，感谢大佬们相助''')
    elif a == '物品':
        za = player.count('饮料')
        zf = int(za)
        az = player.count("医疗包")
        ax = int(az)
        sd = player.count("面包")
        cx = int(sd)
        sw = player.count("熟食")
        sq = int(sw)
        cv = player.count("蜂蜜")
        cb = int(cv)
        xv = player.count('酒精')
        xd = int(xv)
        cj = player.count('木板')
        co = int(cj)
        ch = player.count('碎石')
        cv = int(ch)
        lm = player.count('木棍')
        cd = int(lm)
        print("你有 {0} 个饮料".format(zf))
        print("你有 {0} 个医疗包".format(ax))
        print("你有 {0} 个面包".format(cx))
        print("你有 {0} 个熟食".format(sq))
        print("你有 {0} 个蜂蜜".format(cb))
        print("你有 {0} 个酒精".format(xd))
        print("你有 {0} 个木板".format(co))
        print("你有 {0} 个碎石".format(cv))
        print("你有 {0} 个木棍".format(cd))
        alp = zf+ax+cx+sq+cb+xd+co+cv+cd
        print("你一共拥有 {0} 件物品".format(alp))
        print('''''')
    elif a == '猜数':
        secret = random.randint(1, 50)
        print("       .........猜数游戏.........")
        temp = input('''————————————————————————————————————————
请猜出我在1至50所选的数，一次猜中有大奖
你总共有十次机会，机会一完，自动结束
————————————————————————————————————————
(请发送你所猜想的数字)
————————————————————————————————————————
你:''')
        guess = int(temp)
        az = 0
        while az < 9:
            az = az + 1
            if guess != secret:
                temp = input('''回答错误，请重新输入数字!!!
你:''')
                guess = int(temp)
                if guess == secret:
                    print("恭喜你，猜对了，奖励你20元吧")
                    rmb = rmb + 20
                    break
                else:
                    if guess > secret:
                        print("过了，过了")
                    else:
                        if guess < secret:
                            print("不够，不够")
            else:
                print("恭喜你，一次成功，奖励你50元吧")
                rmb = rmb + 50
                break
    elif a == '计算':
        x = 0
        n = 0
        m = 0
        print("____________________计算答题____________________")
        ab = input('''>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
请输入你想要答的题数,答五题得一元(不足五题不送钱)
无论对错都获得:而且如果你答题超过14题
且准确率高的话还会额外再送钱
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
你:''')
        ac = int(ab)
        if ac > 4:
            rmb = rmb+(ac*0.9)
            print('你发送的答题数超过5题,我们已赠送你[ {0}元 ]'.format(ac*0.9))
        else:
            print("你发送的答题数没有5题，但你也可继续答题")
        while (x < ac):
            x = x + 1
            a = random.randint(1, 1000)
            b = random.randint(1, 1000)
            print("请问 {0}+{1} 等于多少?请输入答案".format(a, b))
            c = input("你:")
            d = int(c)
            e = a + b
            if e == d:
                print("回答正确，请继续答题")
                n = n + 1
            else:
                print("回答错误，正确答案是{0}".format(e))
                m = m + 1
            print("现所在第{0}题 ,你还需要做{1}题".format(x, ac - x))
            print("...............................................................")
            time.sleep(1)
        print("你答对的题数为")
        print(n)
        print("你答错的题数为")
        print(m)
        if 20 >= n >= 0.8 * ac:
            print("你的评分为：     A")
            if ac > 14:
                print("奖励30元")
                rmb = rmb + 30
        if 0.8 * ac > n >= 0.6 * ac:
            print("你的评分为：     B")
            if ac > 14:
                print("奖励10元")
                rmb = rmb + 10
        if 0.6 * ac > n >= 0.4 * ac:
            print("你的评分为：     C")
            if ac > 14:
                print("奖励5元")
                rmb = rmb + 5
        if 0.4 * ac > n >= 0.2 * ac:
            print("你的评分为：     D")
            print("没有奖励")
        if 0.2 * ac > n >= 0:
            print("你的评分为：     E")
    elif a == '拾荒':
        ac = input('''
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
拾荒：每次拾荒需要1体力
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
[饮料]            ^
[医疗包]          ^
[木板]            ^
[碎石]            ^
[木棍]            ^
[面包]            ^
[熟食]            ^
[酒精]            ^
[蜂蜜]            ^
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
请发送去拾荒的次数，再发送[ 1 ]出发
>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
---------------------------------------------------------------
你:''')
        ab = int(ac)
        if ab < 1:
            print("数字{0}出现错误,请重新尝试".format(ac))
        else:
            moy = 1*ab
            b = input('''---------------------------------------------------------------
你确定使用 [{0}] 体力拾 [{1}] 次荒吗？


发送[ 1 ]确定
---------------------------------------------------------------
你:'''.format(moy, ab))
            if not b.isdigit():
                print("请输入数字！")
            else:
                c = int(b)
                if c == 1:
                    if tl < moy:
                        print("你的体力不足，请到使用饮料恢复")
                    else:
                        az = 0
                        tl = tl-moy
                        while (az < ab):
                            time.sleep(2)
                            az = az + 1
                            a = random.randint(1, 200)
                            if a == 1:  # 1
                                player.append('医疗包')
                                print('恭喜你，你找到了”医疗包“')
                            if 1 < a < 5:  # 3
                                player.append('酒精')
                                print('恭喜你，你找到了”酒精“')
                            if 4 < a < 8:  # 3
                                player.append('熟食')
                                print('恭喜你，你找到了"熟食“')
                            if 7 < a < 15:  # 7
                                player.append('蜂蜜')
                                print('恭喜你，你找到了”蜂蜜“')
                            if 14 < a < 25:  # 10
                                player.append('木板')
                                print('恭喜你，你找到了”木板“')
                            if 24 < a < 35:  # 10
                                player.append('碎石')
                                print('恭喜你，你找到了”碎石“')
                            if 34 < a < 51:  # 16
                                player.append('木棍')
                                print('恭喜你，你找到了”木棍“')
                            if 50 < a < 201:  # 150
                                player.append('饮料')
                                print('恭喜你，你找到了”饮料“')
                        print('物品已经放置到你的仓库，可输入（背包）或者（物品）前去查看')
                        print('''你的体力剩余({0}%)'''.format(tl))
